//=============================================================================
// 
// 背景ヘッダー [bg.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _BG_H_		// このマクロ定義がされていなかったら
#define _BG_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

#endif