//=============================================================================
// 
// 燃料ヘッダー [oil.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _OIL_H_		// このマクロ定義がされていなかったら
#define _OIL_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitOil(void);
void UninitOil(void);
void UpdateOil(void);
void DrawOil(void);

#endif