//======================================================================================
// 
// ケプラーMk3 [result.cpp]
// Author : Kajino Hiyori
//
//======================================================================================
#include "result.h"
#include "fade.h"
#include "main.h"
#include "input.h"
#include "color.h"

//*****************************************************************************
// グローバル変数
//*****************************************************************************
int g_nCounterState = 0;	// ゲームの状態管理カウンター

//=======================================================
// リザルトの初期化処理
//=======================================================
void InitResult(void)
{
	// 変数の初期化
	g_nCounterState = 0;
}

//=======================================================
// リザルトの終了処理
//=======================================================
void UninitResult(void)
{

}

//=======================================================
// リザルトの更新処理
//=======================================================
void UpdateResult(void)
{
	FADE fade = GetFade();
	if (fade == FADE_NONE && ((GetKeyboardTrigger(DIK_RETURN) == true) || GetJoypadTrigger(JOYKEY_A) == true || GetJoypadTrigger(JOYKEY_START) == true))
	{
		SetFade(MODE_TITLE, COLOR_BLACK);
	}
}

//=======================================================
// リザルトの描画処理
//=======================================================
void DrawResult(void)
{

}