//=============================================================================
// 
// リザルトUIヘッダー [result_ui.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _RESULT_UI_H_		// このマクロ定義がされていなかったら
#define _RESULT_UI_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResultUI(void);
void UninitResultUI(void);
void UpdateResultUI(void);
void DrawResultUI(void);

#endif	