//=============================================================================
// 
// スクリーンヘッダー [screen.h]
// Author : 中澤 優奈
// 
//=============================================================================
#ifndef _SCREEN_H_		
#define _SCREEN_H_		// 2重インクルード防止のマクロを定義

//*****************************************************************************
// 画面の状態
//*****************************************************************************
typedef enum
{
	SCREEN_FADE_NONE = 0,		// 何もしてない状態
	SCREEN_FADE_IN,				// フェードイン状態
	SCREEN_FADE_OUT,			// フェードアウト状態
	SCREEN_FADE_MAX
}SCREEN_FADE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitScreen(void);
void UninitScreen(void);
void UpdateScreen(void);
void DrawScreen(void);
void SetScreen(SCREEN_FADE screen, D3DXCOLOR col);

#endif