//======================================================================================
// 
// ケプラーMk3 [fade.cpp]
// Author : Kajino Hiyori
//
//======================================================================================
#include "title.h"
#include "fade.h"
#include "main.h"
#include "input.h"
#include "color.h"

#include "title_ui.h"

//=======================================================
// タイトルの初期化処理
//=======================================================
void InitTitle(void)
{
	// タイトルUIの初期化処理
	InitTitleUI();
}

//=======================================================
// タイトルの終了処理
//=======================================================
void UninitTitle(void)
{
	// タイトルUIの終了処理
	UninitTitleUI();
}

//=======================================================
// タイトルの更新処理
//=======================================================
void UpdateTitle(void)
{
	// タイトルUIの更新処理
	UpdateTitleUI();

	FADE fade = GetFade();
	if (fade == FADE_NONE &&
		GetTitleFinish() == true)
	{
		SetFade(MODE_GAME, COLOR_WHITE);
	}
}

//=======================================================
// タイトルの描画処理
//=======================================================
void DrawTitle(void)
{
	// タイトルUIの描画処理
	DrawTitleUI();
}