//=============================================================================
// 
// タイトルUIヘッダー [title_ui.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _TITLE_UI_H_		// このマクロ定義がされていなかったら
#define _TITLE_UI_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleUI(void);
void UninitTitleUI(void);
void UpdateTitleUI(void);
void DrawTitleUI(void);

bool GetTitleFinish(void);

#endif