//======================================================================================
// 
// ケプラーMk3 [fade.cpp]
// Author : Kajino Hiyori
//
//======================================================================================
#include "title.h"
#include "fade.h"
#include "main.h"
#include "input.h"
#include "color.h"

//=======================================================
// タイトルの初期化処理
//=======================================================
void InitTitle(void)
{

}

//=======================================================
// タイトルの終了処理
//=======================================================
void UninitTitle(void)
{

}

//=======================================================
// タイトルの更新処理
//=======================================================
void UpdateTitle(void)
{
	FADE fade = GetFade();
	if (fade == FADE_NONE && ((GetKeyboardTrigger(DIK_RETURN) == true) || GetJoypadTrigger(JOYKEY_A) == true || GetJoypadTrigger(JOYKEY_START) == true))
	{
		SetFade(MODE_GAME, COLOR_WHITE);
	}
}

//=======================================================
// タイトルの描画処理
//=======================================================
void DrawTitle(void)
{

}